package com.tsimbalyukstudio.hangman;


public class GameActivity {

    private String lightAnimal[] = {"кошка", "собака", "лиса", "енот", "безон", "дельфин", "орел", "пони", "корова", "утка", "олень", "заяц", "медведь", "ишак", "волк", "лев", "свинья"};
    private String mediumAnimal[] = {"орангутан", "кенгуру", "гепард", "ламантин", "гиббон", "песец", "песчанка", "овцебык", "гиппопотам", "бурундук", "тушканчик", "кашалот", "утконос", "шимпанзе", "горилла", "номаскус"};
    private String hardAnimal[] = {"щелезуб", "цивета", "выхухоль", "проехидна", "капибара", "голотурия", "панголин", "трубкозуб", "саламандра", "галаго", "вомбат", "гавиал", "окапи", "валаби", "росомаха", "манул"};

    private String lightCountry[] = {"россия", "украина", "белоруссия", "казахстан", "молдавия", "румыния", "болгария", "венгрия", "сербия", "словакия", "польша", "македония", "китай", "чехия", "австрия", "хорватия", "грузия"};
    private String mediumCountry[] = {"танзания", "кения", "сомали", "перу", "боливия", "парагвай", "ангола", "замбия", "зимбабве", "мозамбик", "австралия", "япония", "индонезия", "исландия", "гватемала", "никорагуа"};
    private String hardCountry[] = {"науру", "норфолк", "ниуэ", "тувалу", "гуам", "питкэрн", "свазиленд", "эритрея", "ватикан", "монако", "лихтенштейн", "мальта", "палау", "валаби", "ангилья", "генси"};

    private String lightCapital[] = {"Алжир", "Астана", "Киев", "Минск", "Москва", "Варна", "Баку", "Берлин", "Будапешт", "Бухарест", "Варшава", "Ватикан", "Вашингтон", "Вена", "Иерусалим", "Париж", "Пекин"};
    private String mediumCapital[] = {"Афины", "Ашхабад", "Багдад", "Бейрут", "Белград", "Богота", "Бриджтаун", "Брюссель", "Вадуц", "Валетта", "Веллингтон", "Виктория", "Джорджтаун", "Исламабад", "Рейкьявик", "Таллинн"};
    private String hardCapital[] = {"Абуджа", "Апиа", "Асмэра", "Асунсьон", "Бамако", "Банги", "Браззавиль", "Бразилиа", "Братислава", "Бужумбура", "Джуба", "Монтевидео", "Нджамена", "Нукуалофа", "Претория", "Тегусигальпа"};

    private String lightSport[] = {"Волейбол", "Баскетбол", "Футбол", "Гандбол", "Поло", "Плавание", "Гандбол", "Стрельба", "Теннис", "Гольф", "Гимнастика", "Атлетика", "Фехтование", "Софтбол", "Триатлон", "Хоккей", "Гребля"};
    private String mediumSport[] = {"Скелетон", "Ралли", "Сноуборд", "мотогонки", "бокс", "борьба", "фристайл", "двоеборие", "регби", "шахматы", "бадминтон", "бильярд", "городки", "пауэрлифтинг", "рэндзю", "сквош"};
    private String hardSport[] = {"Вольтижировка", "футбэг", "чидаобв", "реверси", "акватлон", "свимран", "сиджа", "слэклайн", "кегельбан", "киикинг", "олли", "айкидо", "иницюань", "нятнам", "абир", "панкратион"};

    private String lightProf[] = {"врач", "доктор", "футболист", "спортсмен", "пожарный", "повар", "слесарь", "строитель", "уборщик", "депутат", "гончар", "токарь", "учитель", "юрист", "монтажник", "пекарь", "стеклодув"};
    private String mediumProf[] = {"альпинист", "маркетолог", "архитектор", "нанотехнолог", "биохимик", "реаниматолог", "корреспондент", "микробиолог", "исследователь", "шоколатье", "режиссер", "программист", "патологоанатом", "озеленитель", "бортинженер", "прокурор"};
    private String hardProf[] = {"землеустроитель", "нефролог", "офтальмолог", "эндокринолог", "пульмонолог", "военнослужащий", "хореограф", "инкассатор", "девелопер", "этнограф", "имиджмейкер", "юрисконсульт", "корректор", "андеррайтер", "овощевод", "модист"};

    private String lightFood[] = {"оливье", "борщ", "суп", "плов", "колбаса", "вареники", "пельмени", "гуляш", "узвар", "наполеон", "кисель", "пончик", "компот", "чизкейе", "манты", "рис", "омлет"};
    private String mediumFood[] = {"антрекот", "барбекю", "бефстроганов", "бифштекс", "бозбаш", "ботвинья", "брускета", "буженина", "буррито", "гаспачо", "грибовнийца", "гуслянки", "долма", "мафины", "мамалыга", "пангасиус"};
    private String hardFood[] = {"тарталетки", "толокно", "тыковник", "фрикадельки", "чохохбили", "шанещки", "шпундра", "энтшиладос", "сурими", "сиченики", "савоярди", "ромштекс", "перкельт", "паэлья", "пастрома", "мужужи"};

    private String lightPolitithi[] = {"авангард", "автономия", "авторитет", "анархия", "бюрократия", "геноцид", "глобализация", "государство", "демократия", "идеология", "инновация", "капитализм", "класс", "консерватизм", "коррупция", "легальность", "легитимность"};
    private String mediumPolitithi[] = {"Модернизация", "Меритократия", "Национализм", "Нация", "Олигархия", "Отчуждение", "Парламент", "Пассионарность", "Престиж", "Рабство", "Революция", "Республика", "Собственность", "Социализм", "Ценности", "Цивилизация"};
    private String hardPolitithi[] = {"Аккламация", "Джерримандеринг", "Мажоритарный", "Мандат", "Манипулирование", "Праймериз", "Псефология", "Институт", "Этатизм", "Секулярность", "Бихевиорализм", "Лоббизм", "Меритократия", "Пропаганда", "Конституция", "Конфессия"};

    private String lightStars[] = {"пугачнва", "киркоров", "меладзе", "вайкуле", "фриске", "лобода", "королева", "гагарина", "седакова", "идеология", "брежнева", "каменских", "дубцова", "аллегрова", "ротару", "долина", "варум"};
    private String mediumStars[] = {"орбакайте", "газманов", "николаев", "пушкин", "лермонтов", "лазарев", "гоголь", "блок", "билан", "зверев", "тютчев", "пресняков", "моисеев", "распутина", "ленин", "михайлов"};
    private String hardStars[] = {"достоевский", "зюзькинт", "ремарк", "лондон", "оруэлл", "шолохов", "брэтбери", "грибоедов", "мадонна", "дефо", "пастернак", "горький", "пикуль", "ахматова", "шевченко", "бегбедер"};



    Object tempAr [];
    String tempWord;
    String tempTheme;
    int tempCountWords;

    GameActivity(int hardness, int theme) {
        switch (theme) {
            case 0:
                tempAr = new Object[]{lightAnimal, mediumAnimal, hardAnimal};
                tempTheme = "Животные";
                break;
            case 1:
                tempAr = new Object[]{lightCountry, mediumCountry, hardCountry};
                tempTheme = "Страны";
                break;
            case 2:
                tempAr = new Object[]{lightCapital, mediumCapital, hardCapital};
                tempTheme = "Столицы";
                break;
            case 3:
                tempAr = new Object[]{lightSport, mediumSport, hardSport};
                tempTheme = "Спорт";
                break;
            case 4:
                tempAr = new Object[]{lightProf, mediumProf, hardProf};
                tempTheme = "Профессии";
                break;
            case 5:
                tempAr = new Object[]{lightFood, mediumFood, hardFood};
                tempTheme = "Еда";
                break;
            case 6:
                tempAr = new Object[]{lightPolitithi, mediumPolitithi, hardPolitithi};
                tempTheme = "Политика и терминология";
                break;
            case 7:
                tempAr = new Object[]{lightStars, mediumStars, hardStars};
                tempTheme = "Фамилии писателей и звезд";
                break;
        }

        switch (hardness) {
            case 0:
                String [] s = (String[]) tempAr[0];
                tempWord = s[(int) (Math.random() * s.length)];
                break;
            case 1:
                s = (String[]) tempAr[1];
                tempWord = s[(int) (Math.random() * s.length)];
                break;
            case 2:
                s = (String[]) tempAr[2];
                tempWord = s[(int) (Math.random() * s.length)];
                break;
        }
        tempCountWords = tempWord.length();
    }

    GameActivity(String word, String theme) {
        tempWord = word;
        tempTheme = theme;
        tempCountWords = tempWord.length();
    }

    public char[] parceByLetter() {
        tempWord = tempWord.toLowerCase();
        return tempWord.toCharArray();
    }

    char words[] = {'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'};
    int arCorrectWord [];

    public boolean checkWord(int letterNum) {
        arCorrectWord = new int [parceByLetter().length];
        char c[] = parceByLetter();
        boolean flag = false;
        for (int x = 0; x < parceByLetter().length; x++) {
            if (c[x] == words[letterNum]) {
                flag = true;
                arCorrectWord[x] = 1;
            }
        }
        return flag;
    }
}
